Console.Write("write your name");
string username = Console.ReadLine();
Console.Write("Hello,");
Console.Write(username);
/*
для хранения данных применяются переменные
Переменная имеет тип, имя и значение. 
Тип определяет какого рода инфо может хранить переменная например строки
Синтаксис переменной выглядит так: тип имя_переменной: string name;
так как определение переменной это инструкция, то после ставим ;
После определения переменной можно присвоить значение:
string name;
name = "Tom";
так как это строка то присваиваем ей строку в ""
запись можно сократить:
string name = "Tom";
В программе можно многократно менять значения переменной
*/